{"_path":"/posts/low-cost-upgrade-home-use-modemrouter","_dir":"posts","_draft":false,"_partial":false,"_locale":"","title":"Low cost upgrade to a home-use modem/router","description":"How to upgrade your home router with a bit of technical wizardry","imagesource":null,"imagecredit":null,"imageFilename":"2010.06.08T140000_low-cost-upgrade-home-use-modemrouter.jpg","createdAt":"2010-06-08T14:00:00","updatedAt":"2010-06-08T14:00:00","readingTime":{"text":"0 min read","minutes":0,"time":0,"words":0},"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Hey folks,"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I recently had a problem, where due to a VPN having so many clients, the home-use wireless modem/router we were using kept bumming out and causing connectivity problems for client machines. After a bit of a think, and deciding against spending a huge amount of money on a Cisco system, I came up with the following plan..."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I built a barebones PC from a VIA EPIA 15000G motherboard we had lying around, a 160Gb HDD (although much smaller would have sufficed), and a spare gigabit ethernet card. I then installed "},{"type":"element","tag":"a","props":{"href":"http://www.smoothwall.org/"},"children":[{"type":"text","value":"Smoothwall Express 3.0 SP1"}]},{"type":"text","value":", setting it to Green and Red mode, to allow a port for connection to the LAN, and a port to connect to the Internet."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The next problem I faced was how to go about connecting to our ISP's PPPoA connection, as Smoothwall only has the facility for connecting to PPPoE. I attempted to get a couple of home-use modems to work in full-bridge (PPPoA-PPPoE) mode, but was unsuccessful with every attempt, so shortly abandoned that as a bad job. The solution to this problem was to use a Draytek Vigor 120, which acts as a modem, and a PPPoA-PPPoE converter. The only configuration which was then needed to connect the Smoothwall box to the Internet was done very simply via Smoothwall's sleek web browser interface."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The final issues to clear up were that there was only one LAN port on the router, and that there was no wireless function as yet. Both of these issues were cleared up by connecting a Linksys WRT54GL with "},{"type":"element","tag":"a","props":{"href":"http://www.dd-wrt.com/site/index"},"children":[{"type":"text","value":"DD-WRT v24 SP1"}]},{"type":"text","value":" installed, configured as an "},{"type":"element","tag":"a","props":{"href":"http://www.dd-wrt.com/wiki/index.php/Wireless_Access_Point"},"children":[{"type":"text","value":"access point"}]},{"type":"text","value":", with the WAN port used as another switch port. This achieved both wireless connectivity and allowed access for more than one wired connection to the Internet."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Once this was set up, the BIOS on the motherboard was set to auto-restart on AC loss, and the entire kit was plugged in. Any supplemental configuration, such as NAT/port forwarding, can be very simply configured from the Smoothwall box's web interface."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Nice and simple, and far cheaper and easier to implement than a full blown Cisco system."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"As always, if anybody has any questions, or even spots any errors I've made, just direct them to me via the comments! I'd also be glad to hear of any potential improvements people may have to the system!"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"n00b"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:posts:2010-06-08-low-cost-upgrade-home-use-modemrouter.md","_source":"content","_file":"posts/2010-06-08-low-cost-upgrade-home-use-modemrouter.md","_stem":"posts/2010-06-08-low-cost-upgrade-home-use-modemrouter","_extension":"md"}